B.org
#+TITLE: 附录B Lisp快速参考
#+SETUPFILE: ./resource/template.org

* 在本章：
*基础*
*数据类型*
*控制结构*
*代码对象*

这个附录总结了Emacs中常用的Lisp语法，以及一些重要的Lisp函数。它并不会总结Emacs自身的一些特性，例如buffer，钩子变量，键位表，模式，等等。要完整的查看Emacs Lisp，请参照The GNU Emacs Lisp Reference Manual。获取它的细节请参照[[file:E.org][附录E]]。

* 基础
Lisp表达式是一个可以被计算的数据单位。表达式可能由子表达式构成，就像列表或者向量。

每个Lisp表达式在计算的时候都会返回一个值。大多数表达式都是自运算的，也就是说它们的值就是它们自己。

Lisp表达式可以被认为是一个字面数据而不必求值。非自运算的表达式必须被引用（quoted）来避免求值而作为字面值使用。

符号nil表示否。它与空表()完全相同。其他的Lisp对象都为真，而符号t则是真的真正表示。

Emacs Lisp（不像其他方言）是大小写敏感的。

* 数据类型
** 数字
Emacs Lisp支持整数和浮点数。它们的写法与你想的没什么两样：一个10进制的有一个可选负号以及一个可选小数点的字符串。有一些可以操作数字的函数：
#+BEGIN_SRC emacs-lisp
  (numberp x)
#+END_SRC
判断x是否为数字。

#+BEGIN_SRC emacs-lisp
  (integerp x)
#+END_SRC
判断x是否为整数。

#+BEGIN_SRC emacs-lisp
  (zerop x)
#+END_SRC
判断x是否为0。

#+BEGIN_SRC emacs-lisp
  (= a b)
#+END_SRC
判断两个数字是否相等。

#+BEGIN_SRC emacs-lisp
  (+ a b c ...)
#+END_SRC
加。

#+BEGIN_SRC emacs-lisp
  (- a b c ...)
#+END_SRC
减。

** 字符
在Emacs Lisp中问号用来指代单独的字符。例如，?a表示小写的a。有些特殊字符，特别是用来起始其他Lisp表达式种类的那些，需要使用问号-反斜杠来转义，例如?\"，?\(和?\)。有些特殊字符可以使用反斜杠和字符构成。例如，?\t表示tab，而?\n表示换行符。

字符的求值结果是它的ASCII值。例如，?a的计算结果是97。实际上，整数值可以在任何需要的时候从字符转化；Emacs Lisp并不区分这两种有什么不同，除了为字符提供了一些方便的方法。

#+BEGIN_SRC emacs-lisp
  (char-equal a b)
#+END_SRC
判断两个字符是否相等。如果case-fold-search非空则忽略大小写。

#+BEGIN_SRC emacs-lisp
  (char-to-string c)
#+END_SRC
创建一个只包含c的字符串。

** 字符串
字符串是一个字符的序列，写法上用双括号包裹起来，"like this"。如果字符串中存在双引号或者反斜杠，它必须用反斜杠进行转义，"\"Like this,\" he said."。字符串是自运算的。

Emacs，作为一个文本编辑器，有许多操作字符串的函数。下面是一些小例子：

#+BEGIN_SRC emacs-lisp
  (stringp x)
#+END_SRC
判断x是否是字符串。

#+BEGIN_SRC emacs-lisp
  (string= s1 s2)
#+END_SRC
判断两个字符串是否相等。

#+BEGIN_SRC emacs-lisp
  (string-lessp s1 s2)
#+END_SRC
检测s1在ASCII值比较上是否比s2更小。

#+BEGIN_SRC emacs-lisp
  (concat a b c ...)
#+END_SRC
将所有字符串拼接成一个新字符串。

#+BEGIN_SRC emacs-lisp
  (length s)
#+END_SRC
返回字符串s的长度。

#+BEGIN_SRC emacs-lisp
  (aref s i)
#+END_SRC
返回字符串s的第i个字符，从0开始。

#+BEGIN_SRC emacs-lisp
  (aset s i ch)
#+END_SRC
设置字符串s的第i个字符为ch。

#+BEGIN_SRC emacs-lisp
  (substring s from [to])
#+END_SRC
截取从位置from到位置to处（如果忽略to则到结尾）的s的子字符串。

** 符号
符号是能够有一些与之关联的数据的名称。符号的名字是一个由字符组成的序列，它看起来不能像是数字，字符串，列表，向量，或者其他Lisp数据类型。

符号可以用作变量，函数名，或者自身作为一个值存在。符号的求值结果是它的变量值。

#+BEGIN_SRC emacs-lisp
  (symbolp x)
#+END_SRC
判断x是否是一个符号。

#+BEGIN_SRC emacs-lisp
  (setq sym epr)
#+END_SRC
将sym用作一个变量：并且将expr的值赋给sym。

#+BEGIN_SRC emacs-lisp
  sym
#+END_SRC
计算符号的变量值。

#+BEGIN_SRC emacs-lisp
  (defun sym ...)
#+END_SRC
将sym用作函数名。

#+BEGIN_SRC emacs-lisp
  (sym arg1 arg2 ...)
#+END_SRC
一个以符号开头的列表，表示调用名为sym的函数。

每个符号都有与其关联的属性列表。属性列表是一个映射表，它的键是Lisp符号而值为任何Lisp表达式。

#+BEGIN_SRC emacs-lisp
  (put sym key value)
#+END_SRC
在sym的属性列表里，将value赋给key。

#+BEGIN_SRC emacs-lisp
  (get sym key)
#+END_SRC
从sym的属性列表里取得符号key对应的值，找不到则为nil。

符号通常存储在内部的一个符号表里来防止重复符号的出现。可以显式地向符号表里添加条目或者创建但不向符号表中添加（因此可能会出现与其他符号重名的情况）。

#+BEGIN_SRC emacs-lisp
  (intern string)
#+END_SRC
从内部符号表中返回一个名为string的符号。如果不存在，则创建一个。

#+BEGIN_SRC emacs-lisp
  (make-symbol string)
#+END_SRC
创建一个新的名为string的符号。符号不会被加入到内部符号表里，并且与其他任何对象都不一样，即使是名字相同的对象。

