html/B.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>附录B Lisp快速参考</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">附录B Lisp快速参考</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfe1b0f9">1. 在本章：</a></li>
<li><a href="#org83b4b88">2. 基础</a></li>
<li><a href="#org57cde67">3. 数据类型</a>
<ul>
<li><a href="#org8c28334">3.1. 数字</a></li>
<li><a href="#orgfe9a1b7">3.2. 字符</a></li>
<li><a href="#org45afb71">3.3. 字符串</a></li>
<li><a href="#org3d5f5ae">3.4. 符号</a></li>
<li><a href="#orgbe708a4">3.5. 列表</a></li>
<li><a href="#org6e5eef6">3.6. 向量</a></li>
<li><a href="#orgc5b89c0">3.7. 序列（Sequences）和数组（Arrays）</a></li>
</ul>
</li>
<li><a href="#org2166331">4. 控制结构</a>
<ul>
<li><a href="#orgd82fb77">4.1. 变量</a></li>
<li><a href="#org342cbbe">4.2. 顺序</a></li>
<li><a href="#org4b408be">4.3. 条件</a></li>
<li><a href="#org56e4fb8">4.4. 循环</a></li>
<li><a href="#org2c2f4a6">4.5. 函数调用</a></li>
<li><a href="#org421f574">4.6. 字面数据</a></li>
</ul>
</li>
<li><a href="#orgecf966c">5. 代码对象</a>
<ul>
<li><a href="#org6025963">5.1. 函数</a></li>
<li><a href="#org67565ad">5.2. 宏函数</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe1b0f9" class="outline-2">
<h2 id="orgfe1b0f9"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>基础</b><br />
<b>数据类型</b><br />
<b>控制结构</b><br />
<b>代码对象</b><br />
</p>

<p>
这个附录总结了Emacs中常用的Lisp语法，以及一些重要的Lisp函数。它并不会总结Emacs自身的一些特性，例如buffer，钩子变量，键位表，模式，等等。要完整的查看Emacs Lisp，请参照The GNU Emacs Lisp Reference Manual。获取它的细节请参照<a href="E.html">附录E</a>。<br />
</p>
</div>
</div>

<div id="outline-container-org83b4b88" class="outline-2">
<h2 id="org83b4b88"><span class="section-number-2">2</span> 基础</h2>
<div class="outline-text-2" id="text-2">
<p>
Lisp表达式是一个可以被计算的数据单位。表达式可能由子表达式构成，就像列表或者向量。<br />
</p>

<p>
每个Lisp表达式在计算的时候都会返回一个值。大多数表达式都是自运算的，也就是说它们的值就是它们自己。<br />
</p>

<p>
Lisp表达式可以被认为是一个字面数据而不必求值。非自运算的表达式必须被引用（quoted）来避免求值而作为字面值使用。<br />
</p>

<p>
符号nil表示否。它与空表()完全相同。其他的Lisp对象都为真，而符号t则是真的真正表示。<br />
</p>

<p>
Emacs Lisp（不像其他方言）是大小写敏感的。<br />
</p>
</div>
</div>

<div id="outline-container-org57cde67" class="outline-2">
<h2 id="org57cde67"><span class="section-number-2">3</span> 数据类型</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8c28334" class="outline-3">
<h3 id="org8c28334"><span class="section-number-3">3.1</span> 数字</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Emacs Lisp支持整数和浮点数。它们的写法与你想的没什么两样：一个10进制的有一个可选负号以及一个可选小数点的字符串。有一些可以操作数字的函数：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>numberp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否为数字。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>integerp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否为整数。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>zerop x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否为0。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>= a b<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断两个数字是否相等。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>+ a b c ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
加。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>- a b c ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
减。<br />
</p>
</div>
</div>

<div id="outline-container-orgfe9a1b7" class="outline-3">
<h3 id="orgfe9a1b7"><span class="section-number-3">3.2</span> 字符</h3>
<div class="outline-text-3" id="text-3-2">
<p>
在Emacs Lisp中问号用来指代单独的字符。例如，?a表示小写的a。有些特殊字符，特别是用来起始其他Lisp表达式种类的那些，需要使用问号-反斜杠来转义，例如?\"，?\(和?\)。有些特殊字符可以使用反斜杠和字符构成。例如，?\t表示tab，而?\n表示换行符。<br />
</p>

<p>
字符的求值结果是它的ASCII值。例如，?a的计算结果是97。实际上，整数值可以在任何需要的时候从字符转化；Emacs Lisp并不区分这两种有什么不同，除了为字符提供了一些方便的方法。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>char-equal a b<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断两个字符是否相等。如果case-fold-search非空则忽略大小写。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>char-to-string c<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
创建一个只包含c的字符串。<br />
</p>
</div>
</div>

<div id="outline-container-org45afb71" class="outline-3">
<h3 id="org45afb71"><span class="section-number-3">3.3</span> 字符串</h3>
<div class="outline-text-3" id="text-3-3">
<p>
字符串是一个字符的序列，写法上用双括号包裹起来，"like this"。如果字符串中存在双引号或者反斜杠，它必须用反斜杠进行转义，"\"Like this,\" he said."。字符串是自运算的。<br />
</p>

<p>
Emacs，作为一个文本编辑器，有许多操作字符串的函数。下面是一些小例子：<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>stringp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否是字符串。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>string= s1 s2<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断两个字符串是否相等。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>string-lessp s1 s2<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
检测s1在ASCII值比较上是否比s2更小。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>concat a b c ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
将所有字符串拼接成一个新字符串。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>length s<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回字符串s的长度。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>aref s i<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回字符串s的第i个字符，从0开始。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>aset s i ch<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
设置字符串s的第i个字符为ch。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>substring s from <span style="color: #66D9EF;">[</span>to<span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
截取从位置from到位置to处（如果忽略to则到结尾）的s的子字符串。<br />
</p>
</div>
</div>

<div id="outline-container-org3d5f5ae" class="outline-3">
<h3 id="org3d5f5ae"><span class="section-number-3">3.4</span> 符号</h3>
<div class="outline-text-3" id="text-3-4">
<p>
符号是能够有一些与之关联的数据的名称。符号的名字是一个由字符组成的序列，它看起来不能像是数字，字符串，列表，向量，或者其他Lisp数据类型。<br />
</p>

<p>
符号可以用作变量，函数名，或者自身作为一个值存在。符号的求值结果是它的变量值。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>symbolp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否是一个符号。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> sym epr<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
将sym用作一个变量：并且将expr的值赋给sym。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">sym
</pre>
</div>
<p>
计算符号的变量值。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">sym</span> ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
将sym用作函数名。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>sym arg1 arg2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
一个以符号开头的列表，表示调用名为sym的函数。<br />
</p>

<p>
每个符号都有与其关联的属性列表。属性列表是一个映射表，它的键是Lisp符号而值为任何Lisp表达式。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>put sym key value<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
在sym的属性列表里，将value赋给key。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>get sym key<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
从sym的属性列表里取得符号key对应的值，找不到则为nil。<br />
</p>

<p>
符号通常存储在内部的一个符号表里来防止重复符号的出现。可以显式地向符号表里添加条目或者创建但不向符号表中添加（因此可能会出现与其他符号重名的情况）。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>intern string<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
从内部符号表中返回一个名为string的符号。如果不存在，则创建一个。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>make-symbol string<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
创建一个新的名为string的符号。符号不会被加入到内部符号表里，并且与其他任何对象都不一样，即使是名字相同的对象。<br />
</p>
</div>
</div>
