B.org
** 列表
列表是Lisp的基础。一个列表是0个或多个其他Lisp表达式（也包括其他列表）的序列。列表的写法是用空格分隔它的子表达式；最外面用一个括号括起来。

Lisp中的函数调用也用列表来表示。当执行的时候，列表中的第一个元素作为函数被调用，其它参数作为参数传入。

列表在内部被实现为一个cons cells的链表。因此访问列表中的一个元素需要遍历整个链表直到找到那个元素。

#+BEGIN_SRC emacs-lisp
  (listp x)
#+END_SRC
判断x是否是列表。

#+BEGIN_SRC emacs-lisp
  (null x)
#+END_SRC
判断x是否是空列表。

#+BEGIN_SRC emacs-lisp
  (consp x)
#+END_SRC
判断x是否是非空列表。

#+BEGIN_SRC emacs-lisp
  (car list)
#+END_SRC
返回list中的第一个元素（或者cons cell中的第一个元素）。

#+BEGIN_SRC emacs-lisp
  (cdr list)
#+END_SRC
返回list剩下的部分（除第一个元素之外的部分，或者cons cell中的第二个元素）。

#+BEGIN_SRC emacs-lisp
  (list a b c ...)
#+END_SRC
创建一个新列表，以参数作为子元素。

#+BEGIN_SRC emacs-lisp
  (cons a b)
#+END_SRC
在列表b的开头插入a（或者创建一个新的cons cell (a . b)）。

#+BEGIN_SRC emacs-lisp
  (append list1 list2 ...)
#+END_SRC
去掉每个子列表外面的括号（很高效），把所有元素粘贴在一起，然后再在外面添加一个括号形成一个新的列表。

#+BEGIN_SRC emacs-lisp
  (nth i list)
#+END_SRC
返回list的第i个子表达式，从0开始。

#+BEGIN_SRC emacs-lisp
  (nthcdr i list)
#+END_SRC
返回对list调用n次cdr的结果。

列表在[[file:6.org][第六章]]中有详细的描述。

** 向量
与列表一样，向量也是由0到多个子表达式构成的，写法上把小括号换成中括号。但是不像列表，向量的元素可以随机的访问（不必从头遍历访问内部的数据）。向量是自运算的。

当你编写一个向量时，它的子表达式都自动被引用了。要想先对元素求值再构建向量需要使用vector函数。

#+BEGIN_SRC emacs-lisp
  (vectorp x)
#+END_SRC
判断x是否为向量。

#+BEGIN_SRC emacs-lisp
  (vector a b c ...)
#+END_SRC
创建一个新向量，以参数作为子元素。

#+BEGIN_SRC emacs-lisp
  (length vector)
#+END_SRC
返回向量的长度。

#+BEGIN_SRC emacs-lisp
  (aref vector i)
#+END_SRC
返回向量的第i个子表达式，从0开始。

#+BEGIN_SRC emacs-lisp
  (aset vector i expr)
#+END_SRC
将向量的第i个元素设置为expr。

** 序列（Sequences）和数组（Arrays）
有些Emacs Lisp数据类型是有联系的。字符串和向量都属于数组。数组是一个数据元素的线性集合，它允许对于其元素的随机访问。字符串是字符组成的数组，而向量是由任意表达式组成的数组。函数aref和aset用来操作数组，这对于字符串和向量都有效。

序列是一个更宽泛的包括了数组和列表的数据结构。序列是一个数据元素的线性集合，句号。函数length对于列表，字符串和数组都有效。

#+BEGIN_SRC emacs-lisp
  (arrayp x)
#+END_SRC
判断x是否为数组。

#+BEGIN_SRC emacs-lisp
  (sequencep x)
#+END_SRC
判断x是否为序列。

#+BEGIN_SRC emacs-lisp
  (copy-sequence sequence)
#+END_SRC
返回列表，字符串或者向量的一个拷贝。

* 控制结构
** 变量
要引用一个变量只需要使用它的名字（一个符号）。要给变量赋值，使用setq。
#+BEGIN_SRC emacs-lisp
  (setq x 17) ; 将17赋值给变量x
  x -> 17 ; 变量x的值
#+END_SRC

要创建只在一定范围内有效的临时变量，使用let。
#+BEGIN_SRC emacs-lisp
  (let ((var1 value1)
        (var2 value2)
        ...)
    body1 body2 ...)
#+END_SRC

在let中，任何的vars赋值之前所有的value都会被计算且是无序的。变体let*（语法上与let相同）会先计算valuei并且赋值给vari，然后再计算valuei+1。

** 顺序
要在只允许一个表达式的地方执行多个表达式，使用progn。
#+BEGIN_SRC emacs-lisp
  (progn expr1 expr2)
#+END_SRC

顺序执行每个expr。返回最后一个expr的值。

要按顺序执行表达式而返回第一个子表达式的值，使用progn1。

** 条件
Emacs Lisp中有两种条件表达式：if和cond。
#+BEGIN_SRC emacs-lisp
  (if test
      then
    else1 else2 ...)
#+END_SRC
对test求值。如果结果非nil，对then求值。否则，依次对剩下的每个else表达式求值。返回最后一个表达式的求值结果。

#+BEGIN_SRC emacs-lisp
  (cond ((test1 body11 body12 ...)
         (test2 body21 body22 ...)
         ...))
#+END_SRC
对test1求值。如果结果非空，则顺序对每个body1求值。否则对test2求值。如果结果非空，则顺序对每个body2求值。依次对于每个“cond子句”执行这个流程。返回最后一个表达式的求值结果。

一个通常的习惯是在最后放置一个截取所有的子句：
#+BEGIN_SRC emacs-lisp
  (cond ((test1 body11 body12 ...)
         (test2 body21 body22 ...)
         ...
         (t bodyn1 bodyn2 ...)))
#+END_SRC

逻辑运算符and，or以及not通常与条件语句一起工作--有时替代条件语句。

#+BEGIN_SRC emacs-lisp
  (and expr1 expr2 ...)
#+END_SRC
执行每个expr直到某个返回nil（或者执行完所有子表达式），然后返回。返回值是计算的最后一个表达式的值。这是逻辑运算符“与”，因为and只有当所有的子表达式都不为假时才为真。

表达式
#+BEGIN_SRC emacs-lisp
  (if expr1
      (if expr2
          ..
        (if exprn-1 exprn)))
#+END_SRC
和
#+BEGIN_SRC emacs-lisp
  (if (and expr1 expr2 ... exprn-1)
      exprn)
#+END_SRC
通常都会简写作
#+BEGIN_SRC emacs-lisp
  (and expr1 expr2 ... exprn-1 exprn)
#+END_SRC

表达式
#+BEGIN_SRC emacs-lisp
  (or expr1 expr2 ...)
#+END_SRC
执行每个expr直到某个返回非nil（或者执行完所有子表达式），然后返回。返回值是计算的最后一个表达式的值。这是逻辑运算符“或”因为or只有当所有的子表达式都为假时才为假。

表达式
#+BEGIN_SRC emacs-lisp
  (if a a b)
#+END_SRC
通常简写作
#+BEGIN_SRC emacs-lisp
  (or a b)
#+END_SRC

最后，
#+BEGIN_SRC emacs-lisp
  (not expr)
#+END_SRC
返回expr的逻辑非。如果expr为真，返回nil。如果expr为非，返回t。（有趣的是，not与null是同一个函数。）

** 循环
Emacs Lisp有一个循环函数，while。
#+BEGIN_SRC emacs-lisp
  (while test
    body1 body2 ...)
#+END_SRC
对test求值。如果结果非nil，逐次执行每个body。然后重复。test为nil的时候返回。

