html/B.html

<div id="outline-container-orgbe708a4" class="outline-3">
<h3 id="orgbe708a4"><span class="section-number-3">3.5</span> 列表</h3>
<div class="outline-text-3" id="text-3-5">
<p>
列表是Lisp的基础。一个列表是0个或多个其他Lisp表达式（也包括其他列表）的序列。列表的写法是用空格分隔它的子表达式；最外面用一个括号括起来。<br />
</p>

<p>
Lisp中的函数调用也用列表来表示。当执行的时候，列表中的第一个元素作为函数被调用，其它参数作为参数传入。<br />
</p>

<p>
列表在内部被实现为一个cons cells的链表。因此访问列表中的一个元素需要遍历整个链表直到找到那个元素。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>listp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否是列表。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>null x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否是空列表。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>consp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否是非空列表。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>car list<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回list中的第一个元素（或者cons cell中的第一个元素）。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>cdr list<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回list剩下的部分（除第一个元素之外的部分，或者cons cell中的第二个元素）。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>list a b c ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
创建一个新列表，以参数作为子元素。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>cons a b<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
在列表b的开头插入a（或者创建一个新的cons cell (a . b)）。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>append list1 list2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
去掉每个子列表外面的括号（很高效），把所有元素粘贴在一起，然后再在外面添加一个括号形成一个新的列表。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>nth i list<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回list的第i个子表达式，从0开始。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>nthcdr i list<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回对list调用n次cdr的结果。<br />
</p>

<p>
列表在<a href="6.html">第六章</a>中有详细的描述。<br />
</p>
</div>
</div>

<div id="outline-container-org6e5eef6" class="outline-3">
<h3 id="org6e5eef6"><span class="section-number-3">3.6</span> 向量</h3>
<div class="outline-text-3" id="text-3-6">
<p>
与列表一样，向量也是由0到多个子表达式构成的，写法上把小括号换成中括号。但是不像列表，向量的元素可以随机的访问（不必从头遍历访问内部的数据）。向量是自运算的。<br />
</p>

<p>
当你编写一个向量时，它的子表达式都自动被引用了。要想先对元素求值再构建向量需要使用vector函数。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>vectorp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否为向量。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>vector a b c ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
创建一个新向量，以参数作为子元素。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>length vector<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回向量的长度。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>aref vector i<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回向量的第i个子表达式，从0开始。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>aset vector i expr<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
将向量的第i个元素设置为expr。<br />
</p>
</div>
</div>

<div id="outline-container-orgc5b89c0" class="outline-3">
<h3 id="orgc5b89c0"><span class="section-number-3">3.7</span> 序列（Sequences）和数组（Arrays）</h3>
<div class="outline-text-3" id="text-3-7">
<p>
有些Emacs Lisp数据类型是有联系的。字符串和向量都属于数组。数组是一个数据元素的线性集合，它允许对于其元素的随机访问。字符串是字符组成的数组，而向量是由任意表达式组成的数组。函数aref和aset用来操作数组，这对于字符串和向量都有效。<br />
</p>

<p>
序列是一个更宽泛的包括了数组和列表的数据结构。序列是一个数据元素的线性集合，句号。函数length对于列表，字符串和数组都有效。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>arrayp x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否为数组。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>sequencep x<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
判断x是否为序列。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>copy-sequence sequence<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回列表，字符串或者向量的一个拷贝。<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org2166331" class="outline-2">
<h2 id="org2166331"><span class="section-number-2">4</span> 控制结构</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd82fb77" class="outline-3">
<h3 id="orgd82fb77"><span class="section-number-3">4.1</span> 变量</h3>
<div class="outline-text-3" id="text-4-1">
<p>
要引用一个变量只需要使用它的名字（一个符号）。要给变量赋值，使用setq。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> x 17<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#23558;17&#36171;&#20540;&#32473;&#21464;&#37327;x</span>
x -&gt; 17 <span style="color: #75715E;">; </span><span style="color: #75715E;">&#21464;&#37327;x&#30340;&#20540;</span>
</pre>
</div>

<p>
要创建只在一定范围内有效的临时变量，使用let。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>var1 value1<span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span>var2 value2<span style="color: #A6E22E;">)</span>
      ...<span style="color: #66D9EF;">)</span>
  body1 body2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
在let中，任何的vars赋值之前所有的value都会被计算且是无序的。变体let*（语法上与let相同）会先计算valuei并且赋值给vari，然后再计算valuei+1。<br />
</p>
</div>
</div>

<div id="outline-container-org342cbbe" class="outline-3">
<h3 id="org342cbbe"><span class="section-number-3">4.2</span> 顺序</h3>
<div class="outline-text-3" id="text-4-2">
<p>
要在只允许一个表达式的地方执行多个表达式，使用progn。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">progn</span> expr1 expr2<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
顺序执行每个expr。返回最后一个expr的值。<br />
</p>

<p>
要按顺序执行表达式而返回第一个子表达式的值，使用progn1。<br />
</p>
</div>
</div>

<div id="outline-container-org4b408be" class="outline-3">
<h3 id="org4b408be"><span class="section-number-3">4.3</span> 条件</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Emacs Lisp中有两种条件表达式：if和cond。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> test
    then
  else1 else2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
对test求值。如果结果非nil，对then求值。否则，依次对剩下的每个else表达式求值。返回最后一个表达式的求值结果。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">cond</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>test1 body11 body12 ...<span style="color: #A6E22E;">)</span>
       <span style="color: #A6E22E;">(</span>test2 body21 body22 ...<span style="color: #A6E22E;">)</span>
       ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
对test1求值。如果结果非空，则顺序对每个body1求值。否则对test2求值。如果结果非空，则顺序对每个body2求值。依次对于每个“cond子句”执行这个流程。返回最后一个表达式的求值结果。<br />
</p>

<p>
一个通常的习惯是在最后放置一个截取所有的子句：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">cond</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>test1 body11 body12 ...<span style="color: #A6E22E;">)</span>
       <span style="color: #A6E22E;">(</span>test2 body21 body22 ...<span style="color: #A6E22E;">)</span>
       ...
       <span style="color: #A6E22E;">(</span>t bodyn1 bodyn2 ...<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
逻辑运算符and，or以及not通常与条件语句一起工作&#x2013;有时替代条件语句。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">and</span> expr1 expr2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
执行每个expr直到某个返回nil（或者执行完所有子表达式），然后返回。返回值是计算的最后一个表达式的值。这是逻辑运算符“与”，因为and只有当所有的子表达式都不为假时才为真。<br />
</p>

<p>
表达式<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> expr1
    <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> expr2
        ..
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">if</span> exprn-1 exprn<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
和<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #F92672;">and</span> expr1 expr2 ... exprn-1<span style="color: #66D9EF;">)</span>
    exprn<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
通常都会简写作<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">and</span> expr1 expr2 ... exprn-1 exprn<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
表达式<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">or</span> expr1 expr2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
执行每个expr直到某个返回非nil（或者执行完所有子表达式），然后返回。返回值是计算的最后一个表达式的值。这是逻辑运算符“或”因为or只有当所有的子表达式都为假时才为假。<br />
</p>

<p>
表达式<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> a a b<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
通常简写作<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">or</span> a b<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
最后，<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>not expr<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
返回expr的逻辑非。如果expr为真，返回nil。如果expr为非，返回t。（有趣的是，not与null是同一个函数。）<br />
</p>
</div>
</div>

<div id="outline-container-org56e4fb8" class="outline-3">
<h3 id="org56e4fb8"><span class="section-number-3">4.4</span> 循环</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Emacs Lisp有一个循环函数，while。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">while</span> test
  body1 body2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
对test求值。如果结果非nil，逐次执行每个body。然后重复。test为nil的时候返回。<br />
</p>
</div>
</div>
