B.org
** 函数调用
要调用一个函数就是编写一个列表，它的第一个元素是函数名，剩下的元素是这个函数的参数。
#+BEGIN_SRC emacs-lisp
  (function arg1 arg2 ...)
#+END_SRC
这会使用给定的参数调用function；返回function的结果。

** 字面数据
要使一个字面数据不受控制结构管辖--例如，避免对它求值--使用'引用（quote）它。
#+BEGIN_SRC emacs-lisp
  'expr -> expr
  (quote expr) -> expr ; 等价
#+END_SRC

要使一个字面数据的列表中的子表达式能够求值，使用反引用（backquote），然后去引用（unquote）子表达式。
#+BEGIN_SRC emacs-lisp
  '(a b c) -> (a b c)
  (backquote (a b c)) -> (a b c) ; 等价
  `(a ,b c) -> (a value-of-b c)
#+END_SRC

要去引用一个list类型的表达式然后把它拼接到一个包含着反引用的模板里，使用拼接去引用符，“,@”。
#+BEGIN_SRC emacs-lisp
  (setq b '(x y z))
  `(a ,@b c) -> (a x y z c)
#+END_SRC

* 代码对象
** 函数
函数是下面这种形式的一个列表：
#+BEGIN_SRC emacs-lisp
  (lambda (parameters ...)
    "documentation string"
    body1 body2 ...)
#+END_SRC

文档字符串documentation string是可选的。

当函数执行时，实参会被绑定到参数列表中的parameters中。参数列表中的关键字&optional表示后面的参数都是可选的。如果函数没有为可选参数指定值则默认为nil。最后一个参数可能使用&rest修饰，表示所有剩下的未分配的参数都被放到一个列表里然后赋给这个参数。

函数执行的结果就是最后一个body表达式的结果。

使用defun来定义一个带名字的函数。
#+BEGIN_SRC emacs-lisp
  (defun name (parameters ...)
    "documentation string"
    body1 body2 ...)
#+END_SRC

这会创建一个lambda表达式然后赋值给符号name的函数值（function value）。这与符号name的变量值不同，所以函数名称与变量名称并不会冲突。

** 宏函数
宏函数是一个像lambda表达式一样的列表，但是并不使用lambda创建，而是使用macro。当宏执行时，它的参数不会被计算。相反的，它们被用作字面形式来计算出一个新的Lisp表达式。然后这这个表达式会被求值。

要定义一个带名字的宏，就像defun那样使用defmacro。
