html/B.html

<div id="outline-container-org2c2f4a6" class="outline-3">
<h3 id="org2c2f4a6"><span class="section-number-3">4.5</span> 函数调用</h3>
<div class="outline-text-3" id="text-4-5">
<p>
要调用一个函数就是编写一个列表，它的第一个元素是函数名，剩下的元素是这个函数的参数。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">function</span> arg1 arg2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
这会使用给定的参数调用function；返回function的结果。<br />
</p>
</div>
</div>

<div id="outline-container-org421f574" class="outline-3">
<h3 id="org421f574"><span class="section-number-3">4.6</span> 字面数据</h3>
<div class="outline-text-3" id="text-4-6">
<p>
要使一个字面数据不受控制结构管辖&#x2013;例如，避免对它求值&#x2013;使用'引用（quote）它。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">'expr -&gt; expr
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">quote</span> expr<span style="color: #AE81FF;">)</span> -&gt; expr <span style="color: #75715E;">; </span><span style="color: #75715E;">&#31561;&#20215;</span>
</pre>
</div>

<p>
要使一个字面数据的列表中的子表达式能够求值，使用反引用（backquote），然后去引用（unquote）子表达式。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">'<span style="color: #AE81FF;">(</span>a b c<span style="color: #AE81FF;">)</span> -&gt; <span style="color: #AE81FF;">(</span>a b c<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">backquote</span> <span style="color: #66D9EF;">(</span>a b c<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> -&gt; <span style="color: #AE81FF;">(</span>a b c<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#31561;&#20215;</span>
`<span style="color: #AE81FF;">(</span>a ,b c<span style="color: #AE81FF;">)</span> -&gt; <span style="color: #AE81FF;">(</span>a value-of-b c<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
要去引用一个list类型的表达式然后把它拼接到一个包含着反引用的模板里，使用拼接去引用符，“,@”。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> b '<span style="color: #66D9EF;">(</span>x y z<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
`<span style="color: #AE81FF;">(</span>a ,@b c<span style="color: #AE81FF;">)</span> -&gt; <span style="color: #AE81FF;">(</span>a x y z c<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgecf966c" class="outline-2">
<h2 id="orgecf966c"><span class="section-number-2">5</span> 代码对象</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6025963" class="outline-3">
<h3 id="org6025963"><span class="section-number-3">5.1</span> 函数</h3>
<div class="outline-text-3" id="text-5-1">
<p>
函数是下面这种形式的一个列表：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">lambda</span> <span style="color: #66D9EF;">(</span>parameters ...<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"documentation string"</span>
  body1 body2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
文档字符串documentation string是可选的。<br />
</p>

<p>
当函数执行时，实参会被绑定到参数列表中的parameters中。参数列表中的关键字&amp;optional表示后面的参数都是可选的。如果函数没有为可选参数指定值则默认为nil。最后一个参数可能使用&amp;rest修饰，表示所有剩下的未分配的参数都被放到一个列表里然后赋给这个参数。<br />
</p>

<p>
函数执行的结果就是最后一个body表达式的结果。<br />
</p>

<p>
使用defun来定义一个带名字的函数。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">name</span> <span style="color: #66D9EF;">(</span>parameters ...<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"documentation string"</span>
  body1 body2 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这会创建一个lambda表达式然后赋值给符号name的函数值（function value）。这与符号name的变量值不同，所以函数名称与变量名称并不会冲突。<br />
</p>
</div>
</div>

<div id="outline-container-org67565ad" class="outline-3">
<h3 id="org67565ad"><span class="section-number-3">5.2</span> 宏函数</h3>
<div class="outline-text-3" id="text-5-2">
<p>
宏函数是一个像lambda表达式一样的列表，但是并不使用lambda创建，而是使用macro。当宏执行时，它的参数不会被计算。相反的，它们被用作字面形式来计算出一个新的Lisp表达式。然后这这个表达式会被求值。<br />
</p>

<p>
要定义一个带名字的宏，就像defun那样使用defmacro。<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
